/******************************************************************
 * 2019 (C)   UTCloud Copyright. All Rights Reserved.
 * File name    : utc_util.h
 * Author       : 
 * Version      : V1.0
 * Date         : 2019.11.25
 * Description  :
 * Function List:
 * History      :
*******************************************************************/

#ifndef __UTC_UTIL_H__
#define __UTC_UTIL_H__

/*---------------------------------- Include ---------------------------------*/
#include "global.h"

/*---------------------------------- Define  ---------------------------------*/

/*---------------------------------- Variable Define -------------------------*/

/*---------------------------------- Function declare ------------------------*/
/*******************************************************************************
* Function    : utc_memxcpy
* Description : 逆向数据拷贝
* Input       : des 逆向后的数据
                src 逆向前的数据
				count 数据长度
* Output      : no
* Return      : no
*******************************************************************************/
void utc_memxcpy(u8 *des,u8 *src,u32 count);

/*******************************************************************************
* Function    : utc_asc_to_bcd
* Description : 将ASCII码转换为压缩BCD码
* Input       : des  BCD码数据
                src  ASCII码数据
                count 数据长度
* Output      : no
* Return      : 末尾不够补0x00,非ascii码填0x00   
*******************************************************************************/
s32 utc_asc_to_bcd(u8 *des,u8 *src,u32 count);

/*******************************************************************************
* Function    : utc_crc16
* Description : 计算crc16
* Input       : src   数据
                count 数据长度
* Output      : no
* Return      :   
*******************************************************************************/
u16 utc_crc16(u8 *src, u16 count);

/*******************************************************************************
* Function    : utc_crc32
* Description : 计算crc32
* Input       : src   数据
                count 数据长度
* Output      : no
* Return      : 
*******************************************************************************/
u32 utc_crc32(const u8 * src, u16 count);

/*******************************************************************************
* Function    : utc_lrc8
* Description : 计算lrc8
* Input       : src   数据
                count 数据长度
* Output      : no
* Return      : 
*******************************************************************************/
u8 utc_lrc8(u8 *src, u16 count);

/*******************************************************************************
* Function    : utc_crc8_msb
* Description : 计算crc8 msb
* Input       : src   数据
                count 数据长度
* Output      : no
* Return      : 
*******************************************************************************/
u8 utc_crc8_msb(u8 *src, u8 count, u8 init_crc);

/*******************************************************************************
* Function    : utc_crc8_lsb
* Description : 计算crc8 lsb
* Input       : src   数据
                count 数据长度
* Output      : no
* Return      : 
*******************************************************************************/
u8 utc_crc8_lsb(u8 *src, u8 count, u8 init_crc);

#endif //__UTC_UTIL_H__

